In [1]:
import pandas as pd
import numpy as np

Exercise 1: Getting & Knowing Your Data (Chipo)

In [2]:
chipo = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', sep='\t')

In [3]:
first_10_rows = chipo.head(10)
first_10_rows

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [4]:
total_entries = chipo.shape[0]

In [5]:
total_columns = len(chipo.columns)

In [6]:
column_names = chipo.columns
for column in column_names:
    print(column)

order_id
quantity
item_name
choice_description
item_price

In [7]:
index_info = chipo.index
index_info

RangeIndex(start=0, stop=4622, step=1)

In [8]:
most_ordered_item = chipo['item_name'].value_counts()
most_ordered_item

item_name
Chicken Bowl                             726
Chicken Burrito                          553
Chips and Guacamole                      479
Steak Burrito                            368
Canned Soft Drink                        301
Steak Bowl                               211
Chips                                    211
Bottled Water                            162
Chicken Soft Tacos                       115
Chips and Fresh Tomato Salsa             110
Chicken Salad Bowl                       110
Canned Soda                              104
Side of Chips                            101
Veggie Burrito                            95
Barbacoa Burrito                          91
Veggie Bowl                               85
Carnitas Bowl                             68
Barbacoa Bowl                             66
Carnitas Burrito                          59
Steak Soft Tacos                          55
6 Pack Soft Drink                         54
Chips and Tomatillo Red Chili Salsa       48
Chicken Crispy Tacos                      47
Chips and Tomatillo Green Chili Salsa     43
Carnitas Soft Tacos                       40
Steak Crispy Tacos                        35
Chips and Tomatillo-Green Chili Salsa     31
Steak Salad Bowl                          29
Nantucket Nectar                          27
Barbacoa Soft Tacos                       25
Chips and Roasted Chili Corn Salsa        22
Izze                                      20
Chips and Tomatillo-Red Chili Salsa       20
Veggie Salad Bowl                         18
Chips and Roasted Chili-Corn Salsa        18
Barbacoa Crispy Tacos                     11
Barbacoa Salad Bowl                       10
Chicken Salad                              9
Veggie Soft Tacos                          7
Carnitas Crispy Tacos                      7
Veggie Salad                               6
Carnitas Salad Bowl                        6
Burrito                                    6
Steak Salad                                4
Crispy Tacos                               2
Salad                                      2
Bowl                                       2
Chips and Mild Fresh Tomato Salsa          1
Veggie Crispy Tacos                        1
Carnitas Salad                             1
Name: count, dtype: int64

In [9]:
total_items_ordered = chipo['quantity'].sum()
total_items_ordered

4972

In [10]:
choice_description_counts = chipo['choice_description'].value_counts()
choice_description_counts.head(1)

choice_description
[Diet Coke]    134
Name: count, dtype: int64

In [11]:
chipo['item_price'] = chipo['item_price'].astype(str)
chipo['item_price'] = chipo['item_price'].str.replace('$', '')
chipo['item_price'].head()

0     2.39
1     3.39
2     3.39
3     2.39
4    16.98
Name: item_price, dtype: object

In [12]:
chipo['item_price'] = chipo['item_price'].astype(float)
total_revenue = chipo['item_price'].sum()
print(f"The total revenue is: {total_revenue:.0f}$")

The total revenue is: 34500$

In [13]:
Total_Number_Of_Orders = chipo['order_id'].nunique()
Total_Number_Of_Orders

1834

In [14]:
Average_Order_Value = total_revenue / Total_Number_Of_Orders
Average_Order_Value

18.811428571428575

In [15]:
total_number_of_unique_items_sold = chipo['item_name'].nunique()
total_number_of_unique_items_sold

50

In [16]:
products_over_10 = chipo[chipo['item_price'] > 10]
products_over_10.shape[0]

products_over_10.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1130 entries, 4 to 4619
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            1130 non-null   int64
 1   quantity            1130 non-null   int64
 2   item_name           1130 non-null   object
 3   choice_description  1123 non-null   object
 4   item_price          1130 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 53.0+ KB

In [22]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep='|')

users.head(10)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703

In [23]:
mean_age_per_occupation = users.groupby('occupation')['age'].mean()
mean_age_per_occupation

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [24]:
data1 = pd.DataFrame({
    'ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve']
})

data1

    ID     Name
0  101    Alice
1  102      Bob
2  103  Charlie
3  104    David
4  105      Eve

In [25]:
data2 = pd.DataFrame({
    'ID': [201, 202, 203, 204, 205],
    'Name': ['Frank', 'Grace', 'Hannah', 'Ivy', 'Jack']
})

data2

    ID    Name
0  201   Frank
1  202   Grace
2  203  Hannah
3  204     Ivy
4  205    Jack

In [26]:
data3 = pd.DataFrame({
    'ID': [301, 302, 303, 304, 305],
    'Score': [random.randint(0, 100) for _ in range(5)]
})

data3

    ID  Score
0  301     23
1  302     17
2  303     14
3  304     11
4  305     85

In [27]:
all_data = pd.concat([data1, data2], ignore_index=True)
print(all_data)

    ID     Name
0  101    Alice
1  102      Bob
2  103  Charlie
3  104    David
4  105      Eve
5  201    Frank
6  202    Grace
7  203   Hannah
8  204      Ivy
9  205     Jack

In [28]:
all_data_col = pd.concat([data1, data2], axis=1)
print(all_data_col)

    ID     Name   ID    Name
0  101    Alice  201   Frank
1  102      Bob  202   Grace
2  103  Charlie  203  Hannah
3  104    David  204     Ivy
4  105      Eve  205    Jack

In [30]:
iris = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data')

iris.head()

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

In [31]:
iris.columns = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']
iris

     sepal_length  sepal_width  petal_length  petal_width         species
0             4.9          3.0           1.4          0.2     Iris-setosa
1             4.7          3.2           1.3          0.2     Iris-setosa
2             4.6          3.1           1.5          0.2     Iris-setosa
3             5.0          3.6           1.4          0.2     Iris-setosa
4             5.4          3.9           1.7          0.4     Iris-setosa
..            ...          ...           ...          ...             ...
144           6.7          3.0           5.2          2.3  Iris-virginica
145           6.3          2.5           5.0          1.9  Iris-virginica
146           6.5          3.0           5.2          2.0  Iris-virginica
147           6.2          3.4           5.4          2.3  Iris-virginica
148           5.9          3.0           5.1          1.8  Iris-virginica

[149 rows x 5 columns]

In [32]:
iris.isnull().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [33]:
pokemon = {'evolution': ['Ivysaur', 'Charmeleon', 'Wartortle', 'Metapod'],
'hp': [45, 39, 44, 45],
'name': ['Bulbasaur', 'Charmander', 'Squirtle', 'Caterpie'],
'pokedex': ['yes', 'no', 'yes', 'no'],
'type': ['grass', 'fire', 'water', 'bug']}

pokemon = pd.DataFrame(pokemon)
pokemon

    evolution  hp        name pokedex   type
0     Ivysaur  45   Bulbasaur     yes  grass
1  Charmeleon  39  Charmander      no   fire
2   Wartortle  44    Squirtle     yes  water
3     Metapod  45    Caterpie      no    bug

In [34]:
pokemon = pokemon[['name', 'type', 'hp', 'evolution', 'pokedex']]
pokemon

         name   type  hp   evolution pokedex
0   Bulbasaur  grass  45     Ivysaur     yes
1  Charmander   fire  39  Charmeleon      no
2    Squirtle  water  44   Wartortle     yes
3    Caterpie    bug  45     Metapod      no

In [36]:

baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

In [37]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

In [38]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 5 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   Name    1016395 non-null  object
 1   Year    1016395 non-null  int64
 2   Gender  1016395 non-null  object
 3   State   1016395 non-null  object
 4   Count   1016395 non-null  int64
dtypes: int64(2), object(3)
memory usage: 38.8+ MB

In [39]:
temperature = [30, 31, 29, 32, 33, 34, 28, 27, 25, 35]
humidity = [80, 75, 70, 85, 90, 80, 75, 60, 65, 70]
wind_speed = [5, 6, 7, 8, 9, 4, 10, 5, 6, 7]

In [41]:
date_rng = pd.date_range(start='2023-01-01', end='2023-01-10', freq='D')

In [42]:
data = {
    'Date': date_rng,
    'Temperature': temperature,
    'Humidity': humidity,
    'Wind_Speed': wind_speed
}

weather_data = pd.DataFrame(data)
weather_data

        Date  Temperature  Humidity  Wind_Speed
0 2023-01-01           30        80           5
1 2023-01-02           31        75           6
2 2023-01-03           29        70           7
3 2023-01-04           32        85           8
4 2023-01-05           33        90           9
5 2023-01-06           34        80           4
6 2023-01-07           28        75          10
7 2023-01-08           27        60           5
8 2023-01-09           25        65           6
9 2023-01-10           35        70           7

In [43]:
frequency = pd.infer_freq(weather_data['Date'])
frequency

'D'

In [44]:
weather_data.set_index('Date', inplace=True)
weather_data

            Temperature  Humidity  Wind_Speed
Date
2023-01-01           30        80           5
2023-01-02           31        75           6
2023-01-03           29        70           7
2023-01-04           32        85           8
2023-01-05           33        90           9
2023-01-06           34        80           4
2023-01-07           28        75          10
2023-01-08           27        60           5
2023-01-09           25        65           6
2023-01-10           35        70           7